

class UnitsPack {

  static const List<List<String>> packs = [
    [
      'Охотник',
      'Оракул',
      'Охотник',
      '',
      'Вассал леса',
      '',

      'Огр',
      '',
      'Кентавр-латник',
      'Гоблин-лучник',
      'Гоблин-траппер',
      '',
    ],
    [
      'Рейнджер',
      'Жрец',
      'Рейнджер',
      'Сквайр',
      'Рыцарь',
      'Сквайр',

      'Орк',
      'Людоед',
      'Орк',
      'Русалка',
      '',
      ''
    ],
    [
      'Лучник',
      'Жрец',
      '',
      'Сквайр',
      '',
      '',

      'Холмовой великан',
      '',
      '',
      '',
      '',
      ''
    ],

    [
      '',
      'Призрак',
      '',
      '',
      'Рыцарь',
      '',

      'Сквайр',
      'Ледяной великан',
      '',
      '',
      '',
      ''
    ],

    [
      '',
      '',
      '',
      'Сквайр',
      '',
      'Ледяной великан',

      '',
      'Рыцарь',
      '',
      '',
      'Призрак',
      ''
    ],
    // 5
    [
      '',
      'Архидруид',
      '',
      'Сквайр',
      '',
      'Рыцарь',

      '',
      'Горный великан',
      '',
      '',
      '',
      ''
    ],
    // 6
    [
      'Лучник',
      '',
      'Жрец',
      'Сквайр',
      '',
      'Рыцарь на Пегасе',

      'Орк',
      'Орк',
      '',
      '',
      '',
      ''
    ],
  ];

}