

class UnitsPack {

  static const List<List<String>> tournaments = [
    // findme notorius мод мотлина
    [
      'Прорицательница',
      'Ассасин',
      'Ассасин',
      'Рыцарь на Пегасе',
      'Инквизитор',
      '',

      'Герцог',
      'Молох',
      'Черный паладин',
      '',
      '',
      'Демонолог',
    ],
    // 1 diwane crew play off бронза leonok whiter 1
    [
      'Лич',
      'Советник',
      '',
      '',
      'Хан Каменной Пасти',
      'Тварь',

      '',
      'Кентавр-гвардеец',
      'Вассал леса',
      'Бандит',
      'Лич',
      'Охотник',


    ],
    // 2 diwnane leonik prostofilat
    [
      'Советник',
      '',
      'Демонолог',
      'Катафрактарий',
      'Берсеркер',
      'Катафрактарий',

      '',
      'Катафрактарий',
      '',
      'Священник',
      'Громовержец',
      'Патриарх',
    ],
    // 3
    [
      'Священник',
      'Громовержец',
      'Патриарх',
      '',
      'Катафрактарий',
      '',

      'Катафрактарий',
      'Берсеркер',
      'Катафрактарий',
      'Советник',
      '',
      'Демонолог',
    ],
    // 4 findme whiter part 2 9 game diwane
    [
      'Защитник горна',
      'Защитник горна',
      'Защитник горна',
      'Инженер',
      '',
      'Жрец Имира',

      'Берсеркер',
      '',
      'Черный паладин',
      'Пандемониус',
      'Советник',
      'Пандемониус',
    ],
    // 5 findme mifestofel  diwane todo Отступление вылетает
    [
      'Шаманка',
      '',
      'Медуза-охотница',
      '',
      'Ящер-воин',
      '',

      'Гоблин-лучник',
      'Гоблин-траппер',
      'Рыцарь Смерти',
      'Злой дух',
      'Злой дух',
      'Злой дух',
    ],
    //6 Карманница не рабоатет
    [
      'Вампир',
      'Королева личей',
      'Вампир',
      '',
      'Воин',
      '',

      'Отлученный',
      'Копейщик',
      'Головорез',
      '',
      'Ведьмак',
      'Карманница',
    ],
    //7 тУПИТ ии в конце боя
    [
      'Дьяволенок',
      '',
      'Якшини',
      'Черный паладин',
      'Владыка',
      'Возвышенный',

      'Наместник Вотана',
      'Гном',
      '',
      '',
      'Эйра',
      'Инженер',
    ],
    // 8
    [
      'Вампир',
      'Тень',
      'Верховный вампир',
      '',
      'Тамплиер',
      'Рыцарь Смерти',

      '',
      'Искоренитель',
      'Искоренитель',
      'Модеус',
      'Советник',
      'Модеус',
    ],
    // 9
    [
      'Ассасин',
      'Инженер',
      'Патриарх',
      '',
      'Ангел',
      'Ангел',

      '',
      'Хранитель рун',
      'Хранитель рун',
      'Защитник горна',
      'Инженер',
      'Защитник горна',
    ]


  ];

  static const List<List<String>> packs = [
    [
      'Охотник',
      'Оракул',
      'Охотник',
      '',
      'Вассал леса',
      '',

      'Огр',
      '',
      'Кентавр-латник',
      'Гоблин-лучник',
      'Гоблин-траппер',
      '',
    ],
    [
      'Рейнджер',
      'Жрец',
      'Рейнджер',
      'Сквайр',
      'Рыцарь',
      'Сквайр',

      'Орк',
      'Людоед',
      'Орк',
      'Русалка',
      '',
      ''
    ],
    [
      'Лучник',
      'Жрец',
      '',
      'Сквайр',
      '',
      '',

      'Холмовой великан',
      '',
      '',
      '',
      '',
      ''
    ],

    [
      '',
      'Призрак',
      '',
      '',
      'Рыцарь',
      '',

      'Сквайр',
      'Ледяной великан',
      '',
      '',
      '',
      ''
    ],

    [
      '',
      '',
      '',
      'Сквайр',
      '',
      'Ледяной великан',

      '',
      'Рыцарь',
      '',
      '',
      'Призрак',
      ''
    ],
    // 5
    [
      '',
      'Архидруид',
      '',
      'Сквайр',
      '',
      'Рыцарь',

      '',
      'Горный великан',
      '',
      '',
      '',
      ''
    ],
    // 6
    [
      'Лучник',
      '',
      'Жрец',
      'Сквайр',
      '',
      'Рыцарь на Пегасе',

      'Орк',
      'Орк',
      '',
      '',
      '',
      ''
    ],
    // 7
    [
      'Ассасин',
      'Священник',
      '',
      '',
      'Орк-багатур',
      'Орк-багатур',

      '',
      'Орк-багатур',
      'Орк-багатур',
      '',
      'Священник',
      'Ассасин'
    ],
    // 8
    [
      'Ассасин',
      'Разжигатель',
      'Ведьма',
      'Ледяная сущность',
      'Толстый бес',
      'Рыцарь',

      'Рыцарь',
      'Толстый бес',
      'Ледяная сущность',
      'Ведьма',
      'Разжигатель',
      'Ассасин'
    ],
    // 9
    [
      'Суккуб',
      'Архидруид',
      'Травница',
      'Оборотень',
      'Владыка',
      'Оборотень',

      'Оборотень',
      'Владыка',
      'Оборотень',
      'Гоблин-громыхун',
      'Суккуб',
      'Архидруид'
    ],
  ];

}